{
  "metadata": {
    "total_size": 32882387016
  },
  "weight_map": {
    "lang_encoder.lm_head.weight": "pytorch_model-00004-of-00004.bin",
    "lang_encoder.model.embed_tokens.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.0.decoder_layer.input_layernorm.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.0.decoder_layer.mlp.down_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.0.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.0.decoder_layer.mlp.up_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.0.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.0.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.0.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.0.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.0.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.0.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.1.decoder_layer.input_layernorm.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.1.decoder_layer.mlp.down_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.1.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.1.decoder_layer.mlp.up_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.1.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.1.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.1.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.1.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.1.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.1.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.10.decoder_layer.input_layernorm.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.10.decoder_layer.mlp.down_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.10.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.10.decoder_layer.mlp.up_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.10.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.10.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.10.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.10.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.10.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.10.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.11.decoder_layer.input_layernorm.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.11.decoder_layer.mlp.down_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.11.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.11.decoder_layer.mlp.up_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.11.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.11.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.11.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.11.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.11.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.11.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.11.gated_cross_attn_layer.attn.norm.bias": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.11.gated_cross_attn_layer.attn.norm.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.11.gated_cross_attn_layer.attn.to_kv.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.11.gated_cross_attn_layer.attn.to_out.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.11.gated_cross_attn_layer.attn.to_q.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.11.gated_cross_attn_layer.attn_gate": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.11.gated_cross_attn_layer.feed_forward.0.bias": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.11.gated_cross_attn_layer.feed_forward.0.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.11.gated_cross_attn_layer.feed_forward.1.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.11.gated_cross_attn_layer.feed_forward.3.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.11.gated_cross_attn_layer.ff_gate": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.12.decoder_layer.input_layernorm.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.12.decoder_layer.mlp.down_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.12.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.12.decoder_layer.mlp.up_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.12.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.12.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.12.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.12.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.12.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.12.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.13.decoder_layer.input_layernorm.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.13.decoder_layer.mlp.down_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.13.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.13.decoder_layer.mlp.up_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.13.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.13.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.13.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.13.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.13.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.13.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.14.decoder_layer.input_layernorm.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.14.decoder_layer.mlp.down_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.14.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.14.decoder_layer.mlp.up_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.14.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.14.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.14.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.14.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.14.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.14.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.15.decoder_layer.input_layernorm.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.15.decoder_layer.mlp.down_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.15.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.15.decoder_layer.mlp.up_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.15.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.15.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.15.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.15.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.15.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.15.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.15.gated_cross_attn_layer.attn.norm.bias": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.15.gated_cross_attn_layer.attn.norm.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.15.gated_cross_attn_layer.attn.to_kv.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.15.gated_cross_attn_layer.attn.to_out.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.15.gated_cross_attn_layer.attn.to_q.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.15.gated_cross_attn_layer.attn_gate": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.15.gated_cross_attn_layer.feed_forward.0.bias": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.15.gated_cross_attn_layer.feed_forward.0.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.15.gated_cross_attn_layer.feed_forward.1.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.15.gated_cross_attn_layer.feed_forward.3.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.15.gated_cross_attn_layer.ff_gate": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.16.decoder_layer.input_layernorm.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.16.decoder_layer.mlp.down_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.16.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.16.decoder_layer.mlp.up_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.16.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.16.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.16.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.16.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.16.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.16.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.17.decoder_layer.input_layernorm.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.17.decoder_layer.mlp.down_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.17.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.17.decoder_layer.mlp.up_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.17.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.17.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.17.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.17.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.17.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.17.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.18.decoder_layer.input_layernorm.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.18.decoder_layer.mlp.down_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.18.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.18.decoder_layer.mlp.up_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.18.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.18.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.18.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.18.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.18.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.18.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.19.decoder_layer.input_layernorm.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.19.decoder_layer.mlp.down_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.19.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.19.decoder_layer.mlp.up_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.19.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.19.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.19.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.19.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.19.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.19.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.19.gated_cross_attn_layer.attn.norm.bias": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.19.gated_cross_attn_layer.attn.norm.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.19.gated_cross_attn_layer.attn.to_kv.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.19.gated_cross_attn_layer.attn.to_out.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.19.gated_cross_attn_layer.attn.to_q.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.19.gated_cross_attn_layer.attn_gate": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.19.gated_cross_attn_layer.feed_forward.0.bias": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.19.gated_cross_attn_layer.feed_forward.0.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.19.gated_cross_attn_layer.feed_forward.1.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.19.gated_cross_attn_layer.feed_forward.3.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.19.gated_cross_attn_layer.ff_gate": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.2.decoder_layer.input_layernorm.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.2.decoder_layer.mlp.down_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.2.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.2.decoder_layer.mlp.up_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.2.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.2.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.2.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.2.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.2.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.2.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.20.decoder_layer.input_layernorm.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.20.decoder_layer.mlp.down_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.20.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.20.decoder_layer.mlp.up_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.20.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.20.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.20.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.20.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.20.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.20.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00002-of-00004.bin",
    "lang_encoder.model.layers.21.decoder_layer.input_layernorm.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.21.decoder_layer.mlp.down_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.21.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.21.decoder_layer.mlp.up_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.21.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.21.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.21.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.21.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.21.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.21.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.22.decoder_layer.input_layernorm.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.22.decoder_layer.mlp.down_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.22.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.22.decoder_layer.mlp.up_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.22.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.22.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.22.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.22.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.22.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.22.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.23.decoder_layer.input_layernorm.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.23.decoder_layer.mlp.down_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.23.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.23.decoder_layer.mlp.up_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.23.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.23.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.23.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.23.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.23.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.23.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.23.gated_cross_attn_layer.attn.norm.bias": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.23.gated_cross_attn_layer.attn.norm.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.23.gated_cross_attn_layer.attn.to_kv.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.23.gated_cross_attn_layer.attn.to_out.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.23.gated_cross_attn_layer.attn.to_q.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.23.gated_cross_attn_layer.attn_gate": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.23.gated_cross_attn_layer.feed_forward.0.bias": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.23.gated_cross_attn_layer.feed_forward.0.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.23.gated_cross_attn_layer.feed_forward.1.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.23.gated_cross_attn_layer.feed_forward.3.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.23.gated_cross_attn_layer.ff_gate": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.24.decoder_layer.input_layernorm.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.24.decoder_layer.mlp.down_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.24.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.24.decoder_layer.mlp.up_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.24.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.24.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.24.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.24.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.24.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.24.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.25.decoder_layer.input_layernorm.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.25.decoder_layer.mlp.down_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.25.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.25.decoder_layer.mlp.up_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.25.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.25.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.25.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.25.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.25.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.25.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.26.decoder_layer.input_layernorm.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.26.decoder_layer.mlp.down_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.26.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.26.decoder_layer.mlp.up_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.26.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.26.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.26.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.26.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.26.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.26.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.27.decoder_layer.input_layernorm.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.27.decoder_layer.mlp.down_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.27.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.27.decoder_layer.mlp.up_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.27.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.27.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.27.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.27.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.27.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.27.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.27.gated_cross_attn_layer.attn.norm.bias": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.27.gated_cross_attn_layer.attn.norm.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.27.gated_cross_attn_layer.attn.to_kv.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.27.gated_cross_attn_layer.attn.to_out.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.27.gated_cross_attn_layer.attn.to_q.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.27.gated_cross_attn_layer.attn_gate": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.27.gated_cross_attn_layer.feed_forward.0.bias": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.27.gated_cross_attn_layer.feed_forward.0.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.27.gated_cross_attn_layer.feed_forward.1.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.27.gated_cross_attn_layer.feed_forward.3.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.27.gated_cross_attn_layer.ff_gate": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.28.decoder_layer.input_layernorm.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.28.decoder_layer.mlp.down_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.28.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.28.decoder_layer.mlp.up_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.28.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.28.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.28.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.28.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.28.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.28.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.29.decoder_layer.input_layernorm.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.29.decoder_layer.mlp.down_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.29.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.29.decoder_layer.mlp.up_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.29.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.29.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.29.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.29.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.29.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.29.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.3.decoder_layer.input_layernorm.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.3.decoder_layer.mlp.down_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.3.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.3.decoder_layer.mlp.up_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.3.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.3.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.3.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.3.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.3.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.3.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.3.gated_cross_attn_layer.attn.norm.bias": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.3.gated_cross_attn_layer.attn.norm.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.3.gated_cross_attn_layer.attn.to_kv.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.3.gated_cross_attn_layer.attn.to_out.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.3.gated_cross_attn_layer.attn.to_q.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.3.gated_cross_attn_layer.attn_gate": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.3.gated_cross_attn_layer.feed_forward.0.bias": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.3.gated_cross_attn_layer.feed_forward.0.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.3.gated_cross_attn_layer.feed_forward.1.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.3.gated_cross_attn_layer.feed_forward.3.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.3.gated_cross_attn_layer.ff_gate": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.30.decoder_layer.input_layernorm.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.30.decoder_layer.mlp.down_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.30.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.30.decoder_layer.mlp.up_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.30.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.30.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.30.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.30.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.30.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.30.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.31.decoder_layer.input_layernorm.weight": "pytorch_model-00004-of-00004.bin",
    "lang_encoder.model.layers.31.decoder_layer.mlp.down_proj.weight": "pytorch_model-00004-of-00004.bin",
    "lang_encoder.model.layers.31.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00004-of-00004.bin",
    "lang_encoder.model.layers.31.decoder_layer.mlp.up_proj.weight": "pytorch_model-00004-of-00004.bin",
    "lang_encoder.model.layers.31.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00004-of-00004.bin",
    "lang_encoder.model.layers.31.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00004-of-00004.bin",
    "lang_encoder.model.layers.31.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00004-of-00004.bin",
    "lang_encoder.model.layers.31.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00004-of-00004.bin",
    "lang_encoder.model.layers.31.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00004-of-00004.bin",
    "lang_encoder.model.layers.31.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00004-of-00004.bin",
    "lang_encoder.model.layers.31.gated_cross_attn_layer.attn.norm.bias": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.31.gated_cross_attn_layer.attn.norm.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.31.gated_cross_attn_layer.attn.to_kv.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.31.gated_cross_attn_layer.attn.to_out.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.31.gated_cross_attn_layer.attn.to_q.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.31.gated_cross_attn_layer.attn_gate": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.31.gated_cross_attn_layer.feed_forward.0.bias": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.31.gated_cross_attn_layer.feed_forward.0.weight": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.31.gated_cross_attn_layer.feed_forward.1.weight": "pytorch_model-00004-of-00004.bin",
    "lang_encoder.model.layers.31.gated_cross_attn_layer.feed_forward.3.weight": "pytorch_model-00004-of-00004.bin",
    "lang_encoder.model.layers.31.gated_cross_attn_layer.ff_gate": "pytorch_model-00003-of-00004.bin",
    "lang_encoder.model.layers.4.decoder_layer.input_layernorm.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.4.decoder_layer.mlp.down_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.4.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.4.decoder_layer.mlp.up_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.4.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.4.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.4.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.4.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.4.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.4.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.5.decoder_layer.input_layernorm.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.5.decoder_layer.mlp.down_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.5.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.5.decoder_layer.mlp.up_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.5.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.5.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.5.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.5.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.5.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.5.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.6.decoder_layer.input_layernorm.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.6.decoder_layer.mlp.down_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.6.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.6.decoder_layer.mlp.up_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.6.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.6.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.6.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.6.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.6.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.6.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.7.decoder_layer.input_layernorm.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.7.decoder_layer.mlp.down_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.7.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.7.decoder_layer.mlp.up_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.7.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.7.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.7.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.7.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.7.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.7.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.7.gated_cross_attn_layer.attn.norm.bias": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.7.gated_cross_attn_layer.attn.norm.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.7.gated_cross_attn_layer.attn.to_kv.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.7.gated_cross_attn_layer.attn.to_out.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.7.gated_cross_attn_layer.attn.to_q.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.7.gated_cross_attn_layer.attn_gate": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.7.gated_cross_attn_layer.feed_forward.0.bias": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.7.gated_cross_attn_layer.feed_forward.0.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.7.gated_cross_attn_layer.feed_forward.1.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.7.gated_cross_attn_layer.feed_forward.3.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.7.gated_cross_attn_layer.ff_gate": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.8.decoder_layer.input_layernorm.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.8.decoder_layer.mlp.down_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.8.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.8.decoder_layer.mlp.up_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.8.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.8.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.8.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.8.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.8.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.8.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.9.decoder_layer.input_layernorm.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.9.decoder_layer.mlp.down_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.9.decoder_layer.mlp.gate_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.9.decoder_layer.mlp.up_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.9.decoder_layer.post_attention_layernorm.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.9.decoder_layer.self_attn.k_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.9.decoder_layer.self_attn.o_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.9.decoder_layer.self_attn.q_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.9.decoder_layer.self_attn.rotary_emb.inv_freq": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.layers.9.decoder_layer.self_attn.v_proj.weight": "pytorch_model-00001-of-00004.bin",
    "lang_encoder.model.norm.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.frame_embs": "pytorch_model-00004-of-00004.bin",
    "perceiver.latents": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.0.feed_forward.0.bias": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.0.feed_forward.0.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.0.feed_forward.1.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.0.feed_forward.3.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.0.norm_latents.bias": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.0.norm_latents.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.0.norm_media.bias": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.0.norm_media.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.0.to_kv.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.0.to_out.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.0.to_q.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.1.feed_forward.0.bias": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.1.feed_forward.0.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.1.feed_forward.1.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.1.feed_forward.3.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.1.norm_latents.bias": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.1.norm_latents.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.1.norm_media.bias": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.1.norm_media.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.1.to_kv.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.1.to_out.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.1.to_q.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.2.feed_forward.0.bias": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.2.feed_forward.0.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.2.feed_forward.1.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.2.feed_forward.3.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.2.norm_latents.bias": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.2.norm_latents.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.2.norm_media.bias": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.2.norm_media.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.2.to_kv.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.2.to_out.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.2.to_q.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.3.feed_forward.0.bias": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.3.feed_forward.0.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.3.feed_forward.1.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.3.feed_forward.3.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.3.norm_latents.bias": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.3.norm_latents.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.3.norm_media.bias": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.3.norm_media.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.3.to_kv.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.3.to_out.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.3.to_q.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.4.feed_forward.0.bias": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.4.feed_forward.0.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.4.feed_forward.1.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.4.feed_forward.3.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.4.norm_latents.bias": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.4.norm_latents.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.4.norm_media.bias": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.4.norm_media.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.4.to_kv.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.4.to_out.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.4.to_q.weight": "pytorch_model-00004-of-00004.bin",
    "perceiver.layers.5.feed_forward.0.bias": "pytorch_model-00004-of-00004.bin",
